dominikfila/STM32-Nucleo-L476RG-Multi-Sensor-Project/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define LED_G_Pin GPIO_PIN_0
#define LED_G_GPIO_Port GPIOC
#define LED_D_Pin GPIO_PIN_1
#define LED_D_GPIO_Port GPIOC
#define LED_E_Pin GPIO_PIN_2
#define LED_E_GPIO_Port GPIOC
#define LED_C_Pin GPIO_PIN_3
#define LED_C_GPIO_Port GPIOC
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define LED_B_Pin GPIO_PIN_4
#define LED_B_GPIO_Port GPIOC
#define LED_F_Pin GPIO_PIN_5
#define LED_F_GPIO_Port GPIOC
#define S1_button_Pin GPIO_PIN_0
#define S1_button_GPIO_Port GPIOB
#define LED_A_Pin GPIO_PIN_6
#define LED_A_GPIO_Port GPIOC
#define LED_DP_Pin GPIO_PIN_7
#define LED_DP_GPIO_Port GPIOC
#define DISP_COM4_Pin GPIO_PIN_8
#define DISP_COM4_GPIO_Port GPIOC
#define DISP_COM3_Pin GPIO_PIN_9
#define DISP_COM3_GPIO_Port GPIOC
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define DISP_COM2_Pin GPIO_PIN_10
#define DISP_COM2_GPIO_Port GPIOC
#define DISP_COM1_Pin GPIO_PIN_11
#define DISP_COM1_GPIO_Port GPIOC
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define temp_DS18B20_Pin GPIO_PIN_4
#define temp_DS18B20_GPIO_Port GPIOB
#define S2_button_Pin GPIO_PIN_5
#define S2_button_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
